In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('./Downloads/Data/Datasets/NonMedical/companiesNew.csv')

In [3]:
df.head()

   Id                          Name    Number                 Category
0   0                         ! LTD  08209948  Private Limited Company
1   1                        !? LTD  11399177  Private Limited Company
2   2  !BIG IMPACT GRAPHICS LIMITED  11743365  Private Limited Company
3   3                !NNOV8 LIMITED  11006939  Private Limited Company
4   4      !NSPIRED INVESTMENTS LTD  SC606050  Private Limited Company

In [36]:
dfNew = df[0:100000]

In [37]:
dfNew.tail()

,Id,Name,Number,Category,TUI
99995,99995,AARON PREMIUM FINANCE LIMITED,07362306,Private Limited Company,T511
99996,99996,AARON PRIGG ENTERPRISES LIMITED,09288641,Private Limited Company,T511
99997,99997,AARON PRINCE CONSULTING LIMITED,06996571,Private Limited Company,T511
99998,99998,AARON PRINTERS LIMITED,04446484,Private Limited Company,T511
99999,99999,AARON PRINTING AND MAILING SOLUTIONS LIMITED,09632263,Private Limited Company,T511

In [38]:
categories = set(df.Category)

In [39]:
categories

{'Charitable Incorporated Organisation',
 'Community Interest Company',
 'European Public Limited-Liability Company (SE)',
 'Industrial and Provident Society',
 'Investment Company with Variable Capital',
 'Investment Company with Variable Capital (Securities)',
 'Investment Company with Variable Capital(Umbrella)',
 'Limited Liability Partnership',
 'Limited Partnership',
 'Old Public Company',
 'Other Company Type',
 'Other company type',
 "PRI/LBG/NSC (Private, Limited by guarantee, no share capital, use of 'Limited' exemption)",
 'PRI/LTD BY GUAR/NSC (Private, limited by guarantee, no share capital)',
 'PRIV LTD SECT. 30 (Private limited company, section 30 of the Companies Act)',
 'Private Limited Company',
 'Private Unlimited',
 'Private Unlimited Company',
 'Protected Cell Company',
 'Public Limited Company',
 'Registered Society',
 'Royal Charter Company',
 'Scottish Charitable Incorporated Organisation',
 'Scottish Partnership'}

In [40]:
categories.remove('Other company type')

In [41]:
categories

{'Charitable Incorporated Organisation',
 'Community Interest Company',
 'European Public Limited-Liability Company (SE)',
 'Industrial and Provident Society',
 'Investment Company with Variable Capital',
 'Investment Company with Variable Capital (Securities)',
 'Investment Company with Variable Capital(Umbrella)',
 'Limited Liability Partnership',
 'Limited Partnership',
 'Old Public Company',
 'Other Company Type',
 "PRI/LBG/NSC (Private, Limited by guarantee, no share capital, use of 'Limited' exemption)",
 'PRI/LTD BY GUAR/NSC (Private, limited by guarantee, no share capital)',
 'PRIV LTD SECT. 30 (Private limited company, section 30 of the Companies Act)',
 'Private Limited Company',
 'Private Unlimited',
 'Private Unlimited Company',
 'Protected Cell Company',
 'Public Limited Company',
 'Registered Society',
 'Royal Charter Company',
 'Scottish Charitable Incorporated Organisation',
 'Scottish Partnership'}

In [42]:
dfNew = dfNew[['Name','Number','Category']]

In [43]:
dfNew.tail()

,Name,Number,Category
99995,AARON PREMIUM FINANCE LIMITED,07362306,Private Limited Company
99996,AARON PRIGG ENTERPRISES LIMITED,09288641,Private Limited Company
99997,AARON PRINCE CONSULTING LIMITED,06996571,Private Limited Company
99998,AARON PRINTERS LIMITED,04446484,Private Limited Company
99999,AARON PRINTING AND MAILING SOLUTIONS LIMITED,09632263,Private Limited Company

In [44]:
categoriesDict = {}

In [45]:
count = 500

In [46]:
for category in categories:
    categoriesDict[category] = 'T' + str(count)
    count += 1

In [47]:
categoriesDict

{'Limited Partnership': 'T500',
 'Investment Company with Variable Capital': 'T501',
 'Limited Liability Partnership': 'T502',
 'Private Unlimited Company': 'T503',
 'Registered Society': 'T504',
 'Charitable Incorporated Organisation': 'T505',
 'Private Unlimited': 'T506',
 'Old Public Company': 'T507',
 'PRIV LTD SECT. 30 (Private limited company, section 30 of the Companies Act)': 'T508',
 'Scottish Charitable Incorporated Organisation': 'T509',
 'European Public Limited-Liability Company (SE)': 'T510',
 'Private Limited Company': 'T511',
 'Investment Company with Variable Capital(Umbrella)': 'T512',
 "PRI/LBG/NSC (Private, Limited by guarantee, no share capital, use of 'Limited' exemption)": 'T513',
 'Royal Charter Company': 'T514',
 'PRI/LTD BY GUAR/NSC (Private, limited by guarantee, no share capital)': 'T515',
 'Community Interest Company': 'T516',
 'Public Limited Company': 'T517',
 'Scottish Partnership': 'T518',
 'Investment Company with Variable Capital (Securities)': 'T519',
 'Industrial and Provident Society': 'T520',
 'Other Company Type': 'T521',
 'Protected Cell Company': 'T522'}

In [48]:
temp = list(range(0,100000))

In [49]:
newList = []

In [50]:
for entry in temp:
    newList.append('CN' + str(entry).zfill(8))

In [51]:
cuis = pd.Series(data=newList)

In [52]:
dfNew['CUI'] = cuis

In [53]:
dfNew.head()

                           Name    Number                 Category         CUI
0                         ! LTD  08209948  Private Limited Company  CN00000000
1                        !? LTD  11399177  Private Limited Company  CN00000001
2  !BIG IMPACT GRAPHICS LIMITED  11743365  Private Limited Company  CN00000002
3                !NNOV8 LIMITED  11006939  Private Limited Company  CN00000003
4      !NSPIRED INVESTMENTS LTD  SC606050  Private Limited Company  CN00000004

In [54]:
dfNew.Category = dfNew.Category.str.replace('Other company type','Other Company Type')

In [55]:
tuis = []

In [56]:
for i in range(0,100000):
    tuis.append(categoriesDict[dfNew.loc[i].Category])

In [57]:
dfNew['TUI'] = pd.Series(data=tuis)

In [58]:
dfNew.head()

,Name,Number,Category,CUI,TUI
0,! LTD,08209948,Private Limited Company,CN00000000,T511
1,!? LTD,11399177,Private Limited Company,CN00000001,T511
2,!BIG IMPACT GRAPHICS LIMITED,11743365,Private Limited Company,CN00000002,T511
3,!NNOV8 LIMITED,11006939,Private Limited Company,CN00000003,T511
4,!NSPIRED INVESTMENTS LTD,SC606050,Private Limited Company,CN00000004,T511

In [59]:
dfNew.tail()

,Name,Number,Category,CUI,TUI
99995,AARON PREMIUM FINANCE LIMITED,07362306,Private Limited Company,CN00099995,T511
99996,AARON PRIGG ENTERPRISES LIMITED,09288641,Private Limited Company,CN00099996,T511
99997,AARON PRINCE CONSULTING LIMITED,06996571,Private Limited Company,CN00099997,T511
99998,AARON PRINTERS LIMITED,04446484,Private Limited Company,CN00099998,T511
99999,AARON PRINTING AND MAILING SOLUTIONS LIMITED,09632263,Private Limited Company,CN00099999,T511

In [61]:
dfNew2 = dfNew[['CUI']]

In [63]:
dfNew2['STR'] = dfNew.Name

/home/applied/python372/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [65]:
dfNew2['CODE'] = dfNew.Number

/home/applied/python372/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [66]:
dfNew2['TYPE'] = dfNew.Category

/home/applied/python372/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [67]:
dfNew2['TUI'] = dfNew['TUI']

In [68]:
dfNew2.head()

,CUI,STR,CODE,TYPE,TUI
0,CN00000000,! LTD,08209948,Private Limited Company,T511
1,CN00000001,!? LTD,11399177,Private Limited Company,T511
2,CN00000002,!BIG IMPACT GRAPHICS LIMITED,11743365,Private Limited Company,T511
3,CN00000003,!NNOV8 LIMITED,11006939,Private Limited Company,T511
4,CN00000004,!NSPIRED INVESTMENTS LTD,SC606050,Private Limited Company,T511

In [69]:
dfNew2.to_csv('./Downloads/Data/Datasets/NonMedical/companies100000.csv', index=False)